In [57]:
import pandas as pd
import numpy as np

In [59]:
orders = pd.read_csv('data/orders.csv')
print("The shape of orders data is", orders.shape)
orders.head()

The shape of orders data is (200, 8)

,id,first_name,last_name,email,shoe_type,shoe_material,shoe_color,price
0,97916,Douglas,Perez,DouglasPerez28@gmail.com,stilettos,fabric,brown,90
1,67691,Tiffany,O'neill,TiffanyO'neill51@gmail.com,wedges,leather,navy,94
2,72818,Susan,Rivas,Susan.Rivas@gmail.com,sandals,faux-leather,white,96
3,28080,Angela,Hopper,AngelaHopper62@outlook.com,stilettos,leather,red,96
4,89958,Thomas,Benjamin,TBenjamin1981@gmail.com,sandals,faux-leather,navy,97

## 2
Our finance department wants to know the price of the most expensive pair of shoes purchased. Save your answer to the variable most_expensive

In [62]:
most_expensive = orders['price'].max()
most_expensive

498

## 3
Our fashion department wants to know how many different colors of shoes we are selling. Save your answer to the variable num_colors

In [65]:
num_colors = orders.shoe_color.nunique()
num_colors

5

# Calculating Aggregate Functions I

**In general, we use the following syntax to calculate aggregates:**
>df.groupby('column1').column2.measurement()

Finance department wanted to know the most expensive shoe that we sold.

Now, they want to know the most expensive shoe for each shoe_type (i.e., the most expensive boot, the most expensive ballet flat, etc.).

Save your answer to the variable pricey_shoes

In [70]:
pricey_shoes = orders.groupby('shoe_type').price.max()
pricey_shoes

shoe_type
ballet flats    498
sandals         498
stilettos       468
wedges          488
Name: price, dtype: int64

In [72]:
print(type(pricey_shoes))

<class 'pandas.core.series.Series'>

**After using groupby, we often need to clean our resulting data.**
> df.groupby('column1').column2.measurement() .reset_index()

In [75]:
pricey_shoes = orders.groupby('shoe_type').price.max().reset_index()
print(type(pricey_shoes))
pricey_shoes

<class 'pandas.core.frame.DataFrame'>

      shoe_type  price
0  ballet flats    498
1       sandals    498
2     stilettos    468
3        wedges    488

Let’s calculate the 25th percentile for shoe price for each shoe_color to help Marketing decide if we have enough cheap shoes on sale. Save the data to the variable cheap_shoes

In [78]:
# np.percentile can calculate any percentile over an array of values
cheap_shoes = orders.groupby('shoe_color').price.apply(lambda x: np.percentile(x, 25)).reset_index()
cheap_shoes

  shoe_color  price
0      black  130.0
1      brown  248.0
2       navy  200.0
3        red  157.0
4      white  188.0

Purchasing team thinks that certain shoe_type/shoe_color combinations are particularly popular this year (for example, blue ballet flats are all the rage in Paris).

Create a DataFrame with the total number of shoes of each shoe_type/shoe_color combination purchased. Save it to the variable shoe_counts.

You should be able to do this using groupby and count().

Note: When we’re using count(), it doesn’t really matter which column we perform the calculation on. You should use id in this example, but we would get the same answer if we used shoe_type or last_name

In [83]:
shoe_counts = orders.groupby(['shoe_type', 'shoe_color']).id.count().reset_index()
shoe_counts

       shoe_type shoe_color  id
0   ballet flats      black   2
1   ballet flats      brown  11
2   ballet flats       navy  17
3   ballet flats        red  13
4   ballet flats      white   7
5        sandals      black   3
6        sandals      brown  10
7        sandals       navy  13
8        sandals        red  14
9        sandals      white  10
10     stilettos      black   8
11     stilettos      brown  14
12     stilettos       navy   7
13     stilettos        red  16
14     stilettos      white   5
15        wedges      brown  13
16        wedges       navy  16
17        wedges        red   4
18        wedges      white  17

## Pivot

This time, we’ll be looking at data about user visits to the website.

The data is a DataFrame called user_visits. Use print and head() to examine the first few rows of the DataFrame.

In [89]:
user_visits = pd.read_csv('data/page_visits.csv')
print(user_visits.shape)
user_visits.head()

(3000, 6)

,id,first_name,last_name,email,month,utm_source
0,10043,Louis,Koch,LouisKoch43@gmail.com,3 - March,yahoo
1,10150,Bruce,Webb,BruceWebb44@outlook.com,3 - March,twitter
2,10155,Nicholas,Hoffman,Nicholas.Hoffman@gmail.com,2 - February,google
3,10178,William,Key,William.Key@outlook.com,3 - March,yahoo
4,10208,Karen,Bass,KB4971@gmail.com,2 - February,google

The column utm_source contains information about how users got to ShoeFly’s homepage. For instance, if utm_source = Facebook, then the user came to ShoeFly by clicking on an ad on Facebook.com.

Use a groupby statement to calculate how many visits came from each of the different sources. Save your answer to the variable click_source.

Remember to use reset_index()!

In [92]:
click_source = user_visits.groupby('utm_source').id.count().reset_index()
click_source

  utm_source   id
0      email  462
1   facebook  823
2     google  543
3    twitter  415
4      yahoo  757

Our Marketing department thinks that the traffic to our site has been changing over the past few months. Use groupby to calculate the number of visits to our site from each utm_source for each month. Save your answer to the variable click_source_by_month.

In [95]:
click_source_by_month = user_visits.groupby(['utm_source', 'month']).id.count().reset_index()
click_source_by_month

   utm_source         month   id
0       email   1 - January   43
1       email  2 - February  147
2       email     3 - March  272
3    facebook   1 - January  404
4    facebook  2 - February  263
5    facebook     3 - March  156
6      google   1 - January  127
7      google  2 - February  196
8      google     3 - March  220
9     twitter   1 - January  164
10    twitter  2 - February  154
11    twitter     3 - March   97
12      yahoo   1 - January  262
13      yahoo  2 - February  240
14      yahoo     3 - March  255

The head of Marketing is complaining that this table is hard to read. Use pivot to create a pivot table where the rows are utm_source and the columns are month. Save your results to the variable click_source_by_month_pivot.

It should look something like this:

In [98]:
click_source_by_month_pivot = click_source_by_month.pivot(columns='month', index='utm_source', values='id').reset_index()
click_source_by_month_pivot

month utm_source  1 - January  2 - February  3 - March
0          email           43           147        272
1       facebook          404           263        156
2         google          127           196        220
3        twitter          164           154         97
4          yahoo          262           240        255